---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures
source: html/7857c588-1861-cfd1-1423-7b950a01aba1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures

Failures about Opening.

## Syntax (C#)
```csharp
public static class OpeningFailures
```